tangyangguang/FarmAuto/apps/Esp32FarmDoor/src/FarmDoorApp.cpp
  g_currentSensor.adcPin = FarmDoorHw.pins().currentAdc;
  g_currentSensor.amplifierGain = 50.0f;
  g_currentSensor.senseResistorMilliOhm = 5.0f;
  g_currentSensor.bidirectional = true;

#if FARMAUTO_FARMDOOR_ENABLE_INA240A2
  g_currentGuard.enabled = false;  // 软件支持已接入；实测校准前默认不启用保护动作。
#else
  g_currentGuard.enabled = false;
#endif
  g_currentGuard.warningThresholdMa = 1800;
  g_currentGuard.faultThresholdMa = 2500;
  g_currentGuard.startupGraceMs = 1000;

  g_recordStoreConfig.layoutVersion = 1;
  g_recordStoreConfig.baseAddress = 0;
  g_recordStoreConfig.totalBytes = 16 * 1024;
  g_recordStoreConfig.pageSize = 64;

  g_doorConfig.closedPositionPulses = 0;
  g_doorConfig.openTargetPulses = kDefaultOpenTargetPulses;
  g_doorConfig.maxRunPulses = kDefaultMaxRunPulses;
  g_doorConfig.maxRunMs = g_motorProtection.maxRunMs;
  const DoorCommandResult doorConfigResult = g_door.configure(g_doorConfig);
  if (doorConfigResult != DoorCommandResult::Ok) {
    ESP32BASE_LOG_E("farmdoor", "door_config_failed result=%u", static_cast<unsigned>(doorConfigResult));
  }
}

void FarmDoorApp::configureAppConfigPage() {
#if ESP32BASE_ENABLE_APP_CONFIG
  Esp32BaseAppConfig::setTitle("Esp32FarmDoor 参数");
  Esp32BaseAppConfig::setChangeCallback(onAppConfigChange);
  Esp32BaseAppConfig::addGroup({"motor", "电机"});
  Esp32BaseAppConfig::addGroup({"protection", "保护"});
  Esp32BaseAppConfig::addGroup({"current", "电流检测"});

  Esp32BaseAppConfig::addInt({"motor", "door", "speed", "运行速度", 60, 10, 100, 5, "%",
                              "普通开门/关门速度。", false, nullptr});
  Esp32BaseAppConfig::addBool({"motor", "door", "motorOutput", "启用电机输出", false,
                               "启用后开关门命令会输出 AT8236 PWM。", true, nullptr});
  Esp32BaseAppConfig::addDecimal({"motor", "door", "openTurns", "开门目标", 500, 0, 2000, 5, 2,
                                  "圈", "开门目标圈数，可由校准流程更新。", false, nullptr});
  Esp32BaseAppConfig::addInt({"protection", "door", "maxRunMs", "最大运行时长", 25000, 1000,
                              120000, 1000, "ms", "保底停止边界。", false, nullptr});
  Esp32BaseAppConfig::addBool({"current", "door", "currentGuard", "启用 INA240A2", false,
                               "GPIO33 电流检测，实测稳定后启用。", false, nullptr});
#endif
}

void FarmDoorApp::configureBusinessShell() {
#if ESP32BASE_ENABLE_WEB
  Esp32BaseWeb::setDeviceName("Esp32FarmDoor");
  Esp32BaseWeb::setHomePath("/index");
  Esp32BaseWeb::setHomeMode(Esp32BaseWeb::HOME_APP);
  Esp32BaseWeb::setSystemNavMode(Esp32BaseWeb::SYSTEM_NAV_SECTION);
  Esp32BaseWeb::addNavItem("/index", "首页");
  Esp32BaseWeb::addNavItem("/records", "开关门记录");
  Esp32BaseWeb::addNavItem("/events", "业务事件");
  Esp32BaseWeb::addNavItem("/calibration", "校准");
  Esp32BaseWeb::addNavItem("/diagnostics", "诊断");
  Esp32BaseWeb::addPage("/index", "自动门首页", FarmDoorApp::sendHomePage);
  Esp32BaseWeb::addPage("/records", "自动门记录", FarmDoorApp::sendRecordsPage);
  Esp32BaseWeb::addPage("/events", "业务事件", FarmDoorApp::sendEventsPage);
  Esp32BaseWeb::addPage("/calibration", "行程校准", FarmDoorApp::sendCalibrationPage);
  Esp32BaseWeb::addPage("/diagnostics", "自动门诊断", FarmDoorApp::sendDiagnosticsPage);
  Esp32BaseWeb::addApi("/api/app/status", FarmDoorApp::sendStatusJson);
  Esp32BaseWeb::addApi("/api/app/diagnostics", FarmDoorApp::sendDiagnosticsJson);
  Esp32BaseWeb::addApi("/api/app/events/recent", FarmDoorApp::sendRecentEventsJson);
  Esp32BaseWeb::addApi("/api/app/records", FarmDoorApp::sendRecordsJson);
  Esp32BaseWeb::addApi("/api/app/door/open", FarmDoorApp::handleDoorOpen);
  Esp32BaseWeb::addApi("/api/app/door/close", FarmDoorApp::handleDoorClose);
  Esp32BaseWeb::addApi("/api/app/door/stop", FarmDoorApp::handleDoorStop);
  Esp32BaseWeb::addApi("/api/app/maintenance/set-position", FarmDoorApp::handleSetPosition);
  Esp32BaseWeb::addApi("/api/app/maintenance/set-travel", FarmDoorApp::handleSetTravel);
  Esp32BaseWeb::addApi("/api/app/maintenance/adjust-travel", FarmDoorApp::handleAdjustTravel);
  Esp32BaseWeb::addApi("/api/app/maintenance/clear-fault", FarmDoorApp::handleClearFault);
#endif
}

void FarmDoorApp::sendHomePage() {
#if ESP32BASE_ENABLE_WEB
  const DoorSnapshot snapshot = g_door.snapshot();
  char positionValue[32];
  char targetValue[32];
  char percentValue[16];
  char maxRunValue[32];
  formatInt64WithUnit(positionValue, sizeof(positionValue), snapshot.positionPulses, "脉冲");
  formatInt64WithUnit(targetValue, sizeof(targetValue), snapshot.openTargetPulses, "脉冲");
  formatPercent(percentValue, sizeof(percentValue), positionPercent(snapshot));
  formatInt64WithUnit(maxRunValue, sizeof(maxRunValue), g_doorConfig.maxRunPulses, "脉冲");

  Esp32BaseWeb::sendHeader("自动门首页");
  Esp32BaseWeb::sendPageTitle("自动门首页", "鸡舍自动门状态、操作和维护入口");

  Esp32BaseWeb::beginPanel("门状态");
  Esp32BaseWeb::beginMetricGrid();
  Esp32BaseWeb::sendMetric("控制器状态", stateName(snapshot.state), trustName(snapshot.positionTrustLevel));
  Esp32BaseWeb::sendMetric("当前位置", positionValue, percentValue);
  Esp32BaseWeb::sendMetric("开门目标", targetValue, maxRunValue);
  Esp32BaseWeb::endMetricGrid();
  Esp32BaseWeb::sendInfoRowCompact("当前命令", "正在执行的开关门命令", commandName(snapshot.activeCommand));
  Esp32BaseWeb::sendInfoRowCompact("停止原因", "最近一次停止来源", stopReasonName(snapshot.lastStopReason));
  Esp32BaseWeb::sendInfoRowCompact("故障原因", "业务控制器故障", faultReasonName(snapshot.faultReason));
  if (!g_motorOutputEnabled) {
    Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,
                             "电机输出未启用",
                             "开门和关门命令会被保护拒绝；请在 Esp32Base App Config 中启用。");
  }
  Esp32BaseWeb::endPanel();

  Esp32BaseWeb::beginPanel("门操作");
  Esp32BaseWeb::sendInfoRowCompactForm("开门",
                                       "移动到已保存的开门目标",
                                       nullptr,
                                       "/api/app/door/open",
                                       "开门",
                                       nullptr,
                                       nullptr,
                                       Esp32BaseWeb::UI_OK);
  Esp32BaseWeb::sendInfoRowCompactForm("关门",
                                       "移动到关门基准位置",
                                       nullptr,
                                       "/api/app/door/close",
                                       "关门",
                                       nullptr,
                                       nullptr,
                                       Esp32BaseWeb::UI_INFO);
  Esp32BaseWeb::sendInfoRowCompactForm("停止",
                                       "停止当前运动并保存当前位置",
                                       nullptr,
                                       "/api/app/door/stop",
                                       "停止",
                                       nullptr,
                                       nullptr,
                                       Esp32BaseWeb::UI_DANGER);
  Esp32BaseWeb::endPanel();

  Esp32BaseWeb::beginPanel("快速入口");
  Esp32BaseWeb::sendInfoRowCompactLink("行程校准", "标定端点和调整开门目标", nullptr, "/calibration", "进入", Esp32BaseWeb::UI_INFO);
  Esp32BaseWeb::sendInfoRowCompactLink("开关门记录", "查询自动门操作和维护记录", nullptr, "/records", "进入", Esp32BaseWeb::UI_INFO);
  Esp32BaseWeb::sendInfoRowCompactLink("业务事件", "查看维护、保护和存储告警事件", nullptr, "/events", "进入", Esp32BaseWeb::UI_INFO);
  Esp32BaseWeb::sendInfoRowCompactLink("业务诊断", "查看只读硬件诊断和维护动作", nullptr, "/diagnostics", "进入", Esp32BaseWeb::UI_INFO);
  Esp32BaseWeb::endPanel();
  Esp32BaseWeb::sendFooter();
#endif
}

void FarmDoorApp::sendRecordsPage() {
#if ESP32BASE_ENABLE_WEB
  PageParams params;
  bool valid = readPageParams(15, 15, params);
  uint32_t startIndex = 0;
  valid = valid && pageStartIndex(params, startIndex);

