tangyangguang/FarmAuto/apps/Esp32FarmDoor/src/FarmDoorApp.cpp
  DoorRecordQuery query;
  query.startIndex = startIndex;
  query.limit = static_cast<uint8_t>(params.per);
  char eventType[32] = {};
  if (valid) {
    valid = readUint32ParamOptional("startUnixTime", query.startUnixTime) &&
            readUint32ParamOptional("endUnixTime", query.endUnixTime);
  }
  if (Esp32BaseWeb::getParam("eventType", eventType, sizeof(eventType)) &&
      eventType[0] != '\0') {
    valid = valid && doorRecordTypeFromName(eventType, query.type);
    query.typeFilterEnabled = valid;
  }
  uint32_t archiveIndex = 0;
  if (valid) {
    valid = readUint32ParamOptional("archive", archiveIndex) &&
            archiveIndex <= kDoorRecordMaxArchives;
  }

  char recordQuery[192];
  if (query.typeFilterEnabled) {
    snprintf(recordQuery,
             sizeof(recordQuery),
             "archive=%lu&startUnixTime=%lu&endUnixTime=%lu&eventType=%s",
             static_cast<unsigned long>(archiveIndex),
             static_cast<unsigned long>(query.startUnixTime),
             static_cast<unsigned long>(query.endUnixTime),
             eventType);
  } else {
    snprintf(recordQuery,
             sizeof(recordQuery),
             "archive=%lu&startUnixTime=%lu&endUnixTime=%lu",
             static_cast<unsigned long>(archiveIndex),
             static_cast<unsigned long>(query.startUnixTime),
             static_cast<unsigned long>(query.endUnixTime));
  }

  Esp32BaseWeb::sendHeader("开关门记录");
  Esp32BaseWeb::sendPageTitle("开关门记录", "分页查看自动门操作、校准和维护记录");

  Esp32BaseWeb::beginPanel("筛选");
  Esp32BaseWeb::sendChunk("<form class='editform' method='get' action='/records'>");
  Esp32BaseWeb::sendChunk("<div class='fieldgrid'>");
  char value[16];
  snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(params.per));
  Esp32BaseWeb::sendChunk("<div class='field short'><label for='rec-per'>每页</label><input id='rec-per' name='per' type='number' min='1' max='15' value='");
  Esp32BaseWeb::sendChunk(value);
  Esp32BaseWeb::sendChunk("'></div>");
  snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(archiveIndex));
  Esp32BaseWeb::sendChunk("<div class='field short'><label for='rec-archive'>归档</label><input id='rec-archive' name='archive' type='number' min='0' max='16' value='");
  Esp32BaseWeb::sendChunk(value);
  Esp32BaseWeb::sendChunk("'><small>0 为当前文件，1-16 为轮转归档。</small></div>");
  snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(query.startUnixTime));
  Esp32BaseWeb::sendChunk("<div class='field med'><label for='rec-start-time'>开始时间戳</label><input id='rec-start-time' name='startUnixTime' type='number' min='0' value='");
  Esp32BaseWeb::sendChunk(value);
  Esp32BaseWeb::sendChunk("'></div>");
  snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(query.endUnixTime));
  Esp32BaseWeb::sendChunk("<div class='field med'><label for='rec-end-time'>结束时间戳</label><input id='rec-end-time' name='endUnixTime' type='number' min='0' value='");
  Esp32BaseWeb::sendChunk(value);
  Esp32BaseWeb::sendChunk("'></div>");
  Esp32BaseWeb::sendChunk("<div class='field med'><label for='rec-type'>事件类型</label><input id='rec-type' name='eventType' placeholder='DoorTravelSet' value='");
  Esp32BaseWeb::writeHtmlEscaped(eventType);
  Esp32BaseWeb::sendChunk("'></div>");
  Esp32BaseWeb::sendChunk("</div><div class='actions'><input type='submit' value='筛选'></div></form>");
  Esp32BaseWeb::endPanel();

  if (!valid) {
    Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,
                             "参数无效",
                             "请检查页码、每页数量、归档编号、时间戳或事件类型。");
  }

  Esp32BaseWeb::beginPanel("记录列表");
  Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'>");
  Esp32BaseWeb::sendChunk("<tr><th>序号</th><th>时间</th><th>事件类型</th><th>命令</th><th>结果</th><th>位置变化</th><th>行程变化</th></tr>");

  uint32_t totalRecords = 0;
  uint8_t emitted = 0;
  if (valid) {
#if ESP32BASE_ENABLE_FS
    char recordPath[96];
    DoorRecordPage page;
    const bool hasPath = doorRecordPathForArchive(archiveIndex, recordPath, sizeof(recordPath));
    const DoorRecordReadResult readResult =
        hasPath ? readDoorRecordPage(recordPath,
                                     query,
                                     doorRecordFileSize,
                                     readDoorRecordBytesAt,
                                     nullptr,
                                     page)
                : DoorRecordReadResult::InvalidArgument;
    if (readResult == DoorRecordReadResult::Ok) {
      totalRecords = page.totalRecords;
      for (uint8_t i = 0; i < page.count; ++i) {
        sendRecordHtmlRow(page.records[i]);
        ++emitted;
      }
    } else if (archiveIndex > 0) {
      Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,
                               "归档读取失败",
                               "指定归档暂时不可读或记录文件损坏。");
    }
    if (readResult != DoorRecordReadResult::Ok && archiveIndex == 0)
#endif
    {
      const DoorRecordSnapshot snapshot = g_records.snapshot();
      totalRecords = snapshot.count;
      for (uint8_t i = 0; i < snapshot.count; ++i) {
        if (i < startIndex || emitted >= params.per) {
          continue;
        }
        const DoorRecord& record = snapshot.records[i];
        if (query.startUnixTime > 0 && record.unixTime < query.startUnixTime) {
          continue;
        }
        if (query.endUnixTime > 0 && record.unixTime > query.endUnixTime) {
          continue;
        }
        if (query.typeFilterEnabled && record.type != query.type) {
          continue;
        }
        sendRecordHtmlRow(record);
        ++emitted;
      }
    }
  }
  if (emitted == 0) {
    Esp32BaseWeb::sendChunk("<tr><td colspan='7'>暂无记录</td></tr>");
  }
  Esp32BaseWeb::sendChunk("</table></div>");
  Esp32BaseWeb::Pagination recordPagination = {"/records", recordQuery, params.page, params.per, totalRecords};
  Esp32BaseWeb::sendPagination(recordPagination);
  Esp32BaseWeb::endPanel();
  Esp32BaseWeb::sendFooter();
#endif
}

void FarmDoorApp::sendEventsPage() {
#if ESP32BASE_ENABLE_WEB
  PageParams params;
  bool valid = readPageParams(20, 50, params);
  uint32_t startIndex = 0;
  valid = valid && pageStartIndex(params, startIndex) && startIndex <= UINT16_MAX;

