tangyangguang/FarmAuto/apps/Esp32FarmDoor/src/FarmDoorApp.cpp
  Esp32BaseWeb::sendHeader("业务事件");
  Esp32BaseWeb::sendPageTitle("业务事件", "分页查看维护、保护和存储告警事件");

  if (!FarmAutoEventLog::isReady()) {
    Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,
                             "业务事件存储未就绪",
                             FarmAutoEventLog::lastError());
  }
  if (!valid) {
    Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,
                             "参数无效",
                             "请检查页码或每页数量。");
  }

  Esp32BaseWeb::beginPanel("事件列表");
  Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'>");
  Esp32BaseWeb::sendChunk("<tr><th>ID</th><th>时间</th><th>级别</th><th>领域</th><th>动作</th><th>目标</th><th>消息</th><th>详情</th></tr>");

  BusinessEventTableState state;
  bool readOk = false;
  if (valid) {
    readOk = FarmAutoEventLog::readLatest(static_cast<uint16_t>(startIndex),
                                          static_cast<uint16_t>(params.per),
                                          sendBusinessEventHtmlCallback,
                                          &state);
  }
  if (state.emitted == 0) {
    Esp32BaseWeb::sendChunk("<tr><td colspan='8'>暂无事件</td></tr>");
  }
  Esp32BaseWeb::sendChunk("</table></div>");
  if (valid && !readOk) {
    Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,
                             "业务事件读取失败",
                             FarmAutoEventLog::lastError());
  }
  Esp32BaseWeb::Pagination eventPagination = {"/events", nullptr, params.page, params.per, FarmAutoEventLog::count()};
  Esp32BaseWeb::sendPagination(eventPagination);
  Esp32BaseWeb::endPanel();
  Esp32BaseWeb::sendFooter();
#endif
}

void FarmDoorApp::sendCalibrationPage() {
#if ESP32BASE_ENABLE_WEB
  const DoorSnapshot snapshot = g_door.snapshot();
  char positionValue[32];
  char targetValue[32];
  char pulsesPerRevValue[32];
  char turnsValue[32];
  const int64_t turnsX100 = turnsX100FromOpenTargetPulses(snapshot.openTargetPulses);
  formatInt64WithUnit(positionValue, sizeof(positionValue), snapshot.positionPulses, "脉冲");
  formatInt64WithUnit(targetValue, sizeof(targetValue), snapshot.openTargetPulses, "脉冲");
  formatInt64(pulsesPerRevValue, sizeof(pulsesPerRevValue), g_motorKinematics.outputPulsesPerRev);
  snprintf(turnsValue,
           sizeof(turnsValue),
           "%lld.%02lld 圈",
           static_cast<long long>(turnsX100 / 100),
           static_cast<long long>(llabs(turnsX100 % 100)));

  Esp32BaseWeb::sendHeader("行程校准");
  Esp32BaseWeb::sendPageTitle("校准", "标定当前位置、开门目标和行程微调");

  Esp32BaseWeb::beginPanel("当前位置");
  Esp32BaseWeb::beginMetricGrid();
  Esp32BaseWeb::sendMetric("当前位置", positionValue, trustName(snapshot.positionTrustLevel));
  Esp32BaseWeb::sendMetric("开门目标", targetValue, turnsValue);
  Esp32BaseWeb::sendMetric("每圈信号数", pulsesPerRevValue, "output pulses/rev");
  Esp32BaseWeb::endMetricGrid();
  Esp32BaseWeb::endPanel();

  Esp32BaseWeb::beginPanel("端点标定");
  Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,
                           "需要二次确认",
                           "首次提交会返回确认 token；确认后带相同参数、confirm=true 和 token 再提交。");
  Esp32BaseWeb::sendChunk("<form class='editform' method='post' action='/api/app/maintenance/set-position' onsubmit='return once(this)'>");
  Esp32BaseWeb::sendChunk("<input type='hidden' name='position' value='closed'><div class='fieldgrid'>");
  Esp32BaseWeb::sendChunk("<div class='field med'><label for='closed-token'>确认 token</label><input id='closed-token' name='confirmToken'></div>");
  Esp32BaseWeb::sendChunk("<div class='field short'><label for='closed-confirm'>确认</label><select id='closed-confirm' name='confirm'><option value='true'>确认</option><option value='false'>只申请 token</option></select></div>");
  Esp32BaseWeb::sendChunk("</div><div class='actions'><input class='danger' type='submit' value='把当前位置标为关门基准'></div></form>");
  Esp32BaseWeb::sendChunk("<form class='editform' method='post' action='/api/app/maintenance/set-position' onsubmit='return once(this)'>");
  Esp32BaseWeb::sendChunk("<input type='hidden' name='position' value='open'><div class='fieldgrid'>");
  Esp32BaseWeb::sendChunk("<div class='field med'><label for='open-token'>确认 token</label><input id='open-token' name='confirmToken'></div>");
  Esp32BaseWeb::sendChunk("<div class='field short'><label for='open-confirm'>确认</label><select id='open-confirm' name='confirm'><option value='true'>确认</option><option value='false'>只申请 token</option></select></div>");
  Esp32BaseWeb::sendChunk("</div><div class='actions'><input class='danger' type='submit' value='把当前位置标为开门位置'></div></form>");
  Esp32BaseWeb::endPanel();

  Esp32BaseWeb::beginPanel("行程调整");
  Esp32BaseWeb::sendChunk("<form class='editform' method='post' action='/api/app/maintenance/set-travel' onsubmit='return once(this)'>");
  Esp32BaseWeb::sendChunk("<div class='fieldgrid'>");
  Esp32BaseWeb::sendChunk("<div class='field med'><label for='travel-turns'>开门目标</label><input id='travel-turns' name='openTurnsX100' type='number' min='1' max='2000' value='500'><small>单位为 0.01 圈。</small></div>");
  Esp32BaseWeb::sendChunk("<div class='field med'><label for='travel-token'>确认 token</label><input id='travel-token' name='confirmToken'></div>");
  Esp32BaseWeb::sendChunk("<div class='field short'><label for='travel-confirm'>确认</label><select id='travel-confirm' name='confirm'><option value='true'>确认</option><option value='false'>只申请 token</option></select></div>");
  Esp32BaseWeb::sendChunk("</div><div class='actions'><input class='warn' type='submit' value='设置行程'></div></form>");
  Esp32BaseWeb::sendChunk("<form class='editform' method='post' action='/api/app/maintenance/adjust-travel' onsubmit='return once(this)'>");
  Esp32BaseWeb::sendChunk("<div class='fieldgrid'>");
  Esp32BaseWeb::sendChunk("<div class='field med'><label for='adjust-delta'>微调量</label><input id='adjust-delta' name='deltaTurnsX100' type='number' value='5'><small>单位为 0.01 圈，可为负数。</small></div>");
  Esp32BaseWeb::sendChunk("<div class='field med'><label for='adjust-token'>确认 token</label><input id='adjust-token' name='confirmToken'></div>");
  Esp32BaseWeb::sendChunk("<div class='field short'><label for='adjust-confirm'>确认</label><select id='adjust-confirm' name='confirm'><option value='true'>确认</option><option value='false'>只申请 token</option></select></div>");
  Esp32BaseWeb::sendChunk("</div><div class='actions'><input class='warn' type='submit' value='微调行程'></div></form>");
  Esp32BaseWeb::endPanel();
  Esp32BaseWeb::sendFooter();
#endif
}

void FarmDoorApp::sendDiagnosticsPage() {
#if ESP32BASE_ENABLE_WEB
  char at24cValue[16];
  char currentValue[32];
  const FarmDoorReadOnlyDiagnostics diagnostics = FarmDoorHw.readDiagnostics();
  snprintf(at24cValue, sizeof(at24cValue), "%s", diagnostics.at24cOnline ? "在线" : "离线");
  snprintf(currentValue, sizeof(currentValue), "%d ADC", diagnostics.currentRawAdc);

  Esp32BaseWeb::sendHeader("自动门诊断");
  Esp32BaseWeb::sendPageTitle("诊断", "只读硬件诊断、状态接口和故障维护");

  Esp32BaseWeb::beginPanel("业务诊断");
  Esp32BaseWeb::beginMetricGrid();
  Esp32BaseWeb::sendMetric("AT24C128", at24cValue, g_at24cStoreReady ? "store ready" : "store not ready");
  Esp32BaseWeb::sendMetric("电流采样", currentValue, g_currentGuard.enabled ? "保护启用" : "保护未启用");
  Esp32BaseWeb::sendMetric("电机输出", g_motorOutputEnabled ? "已启用" : "未启用", g_motorOutputReady ? "ready" : "not ready");
  Esp32BaseWeb::endMetricGrid();
  Esp32BaseWeb::sendInfoRowCompactLink("诊断 JSON", "按钮、编码器、AT24C 和电流采样", nullptr, "/api/app/diagnostics", "打开", Esp32BaseWeb::UI_INFO);
  Esp32BaseWeb::sendInfoRowCompactLink("状态 JSON", "自动门运行状态和行程摘要", nullptr, "/api/app/status", "打开", Esp32BaseWeb::UI_INFO);
  Esp32BaseWeb::endPanel();

  Esp32BaseWeb::beginPanel("故障处理");
  Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,
                           "需要二次确认",
                           "首次提交会返回确认 token；确认后带 confirm=true 和 token 再提交。");
  Esp32BaseWeb::sendChunk("<form class='editform' method='post' action='/api/app/maintenance/clear-fault' onsubmit='return once(this)'>");
  Esp32BaseWeb::sendChunk("<div class='fieldgrid'>");
  Esp32BaseWeb::sendChunk("<div class='field med'><label for='clear-token'>确认 token</label><input id='clear-token' name='confirmToken'></div>");
  Esp32BaseWeb::sendChunk("<div class='field short'><label for='clear-confirm'>确认</label><select id='clear-confirm' name='confirm'><option value='true'>确认</option><option value='false'>只申请 token</option></select></div>");
  Esp32BaseWeb::sendChunk("</div><div class='actions'><input class='danger' type='submit' value='清除业务故障'></div></form>");
  Esp32BaseWeb::endPanel();
  Esp32BaseWeb::sendFooter();
#endif
}

void FarmDoorApp::sendStatusJson() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  const DoorSnapshot snapshot = g_door.snapshot();
  beginRawJson(200);
  Esp32BaseWeb::sendChunk("{\"appKind\":\"FarmDoor\",");
  Esp32BaseWeb::sendChunk("\"firmware\":\"");
  Esp32BaseWeb::writeJsonEscaped(Esp32Base::firmwareVersion());
  Esp32BaseWeb::sendChunk("\",\"schemaVersion\":1,");
  Esp32BaseWeb::sendChunk("\"state\":\"");
  Esp32BaseWeb::sendChunk(stateName(snapshot.state));
  Esp32BaseWeb::sendChunk("\",\"activeCommand\":\"");
  Esp32BaseWeb::sendChunk(commandName(snapshot.activeCommand));
  Esp32BaseWeb::sendChunk("\",\"position\":{\"pulses\":");
  sendInt64(snapshot.positionPulses);
  Esp32BaseWeb::sendChunk(",\"percent\":");
  sendUint32(positionPercent(snapshot));
  Esp32BaseWeb::sendChunk(",\"trustLevel\":\"");
  Esp32BaseWeb::sendChunk(trustName(snapshot.positionTrustLevel));
  Esp32BaseWeb::sendChunk("\",\"source\":\"");
  Esp32BaseWeb::sendChunk(snapshot.positionTrustLevel == PositionTrustLevel::Untrusted ? "NotCalibrated" : "Runtime");
  Esp32BaseWeb::sendChunk("\"},\"travel\":{\"closedPulses\":");
  sendInt64(snapshot.closedPositionPulses);
  Esp32BaseWeb::sendChunk(",\"openTargetPulses\":");
  sendInt64(snapshot.openTargetPulses);
  Esp32BaseWeb::sendChunk(",\"outputPulsesPerRev\":");
  sendInt64(kDefaultOutputPulsesPerRev);
  Esp32BaseWeb::sendChunk(",\"maxRunPulses\":");
  sendInt64(g_doorConfig.maxRunPulses);
  Esp32BaseWeb::sendChunk(",\"maxRunMs\":");
  sendUint32(g_doorConfig.maxRunMs);
  Esp32BaseWeb::sendChunk("},\"lastStopReason\":\"");
  Esp32BaseWeb::sendChunk(stopReasonName(snapshot.lastStopReason));
  Esp32BaseWeb::sendChunk("\",\"faultReason\":\"");
  Esp32BaseWeb::sendChunk(faultReasonName(snapshot.faultReason));
  Esp32BaseWeb::sendChunk("\",\"recentCommand\":");
  sendRecentCommandJson();
  Esp32BaseWeb::sendChunk(",");
  Esp32BaseWeb::sendChunk("\"currentSensor\":{\"chip\":\"INA240A2\",\"adcPin\":33,\"enabled\":");
  Esp32BaseWeb::sendChunk(g_currentGuard.enabled ? "true" : "false");
  Esp32BaseWeb::sendChunk("},\"motor\":{\"driver\":\"AT8236\",\"encoderMode\":\"X1\"},");
  sendMotorOutputJson();
  Esp32BaseWeb::sendChunk("}");
  endRawJson();
#endif
}

void FarmDoorApp::sendDiagnosticsJson() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  const FarmDoorReadOnlyDiagnostics diagnostics = FarmDoorHw.readDiagnostics();

  beginRawJson(200);
  Esp32BaseWeb::sendChunk("{\"appKind\":\"FarmDoor\",");
  Esp32BaseWeb::sendChunk("\"mode\":\"readOnlyDiagnostics\",");
  Esp32BaseWeb::sendChunk("\"buttons\":{");
  sendDigitalField("aux", diagnostics.buttonAux);
  Esp32BaseWeb::sendChunk(",");
  sendDigitalField("open", diagnostics.buttonOpen);
  Esp32BaseWeb::sendChunk(",");
  sendDigitalField("close", diagnostics.buttonClose);
  Esp32BaseWeb::sendChunk(",");
  sendDigitalField("stop", diagnostics.buttonStop);
  Esp32BaseWeb::sendChunk("},\"encoder\":{");
  sendDigitalField("a", diagnostics.encoderA);
  Esp32BaseWeb::sendChunk(",");
  sendDigitalField("b", diagnostics.encoderB);
  Esp32BaseWeb::sendChunk("},\"currentSensor\":{\"chip\":\"INA240A2\",\"adcPin\":33,\"rawAdc\":");
  char number[16];
  snprintf(number, sizeof(number), "%d", diagnostics.currentRawAdc);
  Esp32BaseWeb::sendChunk(number);
  Esp32BaseWeb::sendChunk(",\"rawMin\":");
  snprintf(number, sizeof(number), "%d", diagnostics.currentRawMin);
  Esp32BaseWeb::sendChunk(number);
  Esp32BaseWeb::sendChunk(",\"rawMax\":");
  snprintf(number, sizeof(number), "%d", diagnostics.currentRawMax);
  Esp32BaseWeb::sendChunk(number);
  Esp32BaseWeb::sendChunk(",\"rawAvg\":");
  snprintf(number, sizeof(number), "%d", diagnostics.currentRawAvg);
  Esp32BaseWeb::sendChunk(number);
  Esp32BaseWeb::sendChunk(",\"sampleCount\":");
  snprintf(number, sizeof(number), "%u", diagnostics.currentSampleCount);
  Esp32BaseWeb::sendChunk(number);
  Esp32BaseWeb::sendChunk(",\"compileEnabled\":");
#if FARMAUTO_FARMDOOR_ENABLE_INA240A2
  Esp32BaseWeb::sendChunk("true");
#else
  Esp32BaseWeb::sendChunk("false");
#endif
  Esp32BaseWeb::sendChunk(",\"runtimeEnabled\":");
  Esp32BaseWeb::sendChunk(boolJson(g_currentGuard.enabled));
  Esp32BaseWeb::sendChunk("},\"at24c\":{\"address\":\"0x50\",\"online\":");
  Esp32BaseWeb::sendChunk(boolJson(diagnostics.at24cOnline));
  Esp32BaseWeb::sendChunk(",\"storeReady\":");
  Esp32BaseWeb::sendChunk(boolJson(g_at24cStoreReady));
  Esp32BaseWeb::sendChunk("},");
  sendMotorOutputJson();
  Esp32BaseWeb::sendChunk("}");
  endRawJson();
#endif
}

void FarmDoorApp::sendRecentEventsJson() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  uint32_t limitParam = 32;
  uint32_t offsetParam = 0;
  if (!readUint32ParamOptional("limit", limitParam) ||
      !readUint32ParamOptional("start", offsetParam) ||
      limitParam == 0 || limitParam > 100 || offsetParam > UINT16_MAX) {
    beginRawJson(400);
    Esp32BaseWeb::sendChunk("{\"ok\":false,\"error\":\"InvalidArgument\"}");
    endRawJson();
    return;
  }
  BusinessEventJsonState state;
  beginRawJson(200);
  Esp32BaseWeb::sendChunk("{\"store\":\"app_events\",\"ready\":");
  Esp32BaseWeb::sendChunk(boolJson(FarmAutoEventLog::isReady()));
  Esp32BaseWeb::sendChunk(",\"faulted\":");
  Esp32BaseWeb::sendChunk(boolJson(FarmAutoEventLog::faulted()));
  Esp32BaseWeb::sendChunk(",\"count\":");
  sendUint32(FarmAutoEventLog::count());
  Esp32BaseWeb::sendChunk(",\"capacity\":");
  sendUint32(FarmAutoEventLog::capacity());
  Esp32BaseWeb::sendChunk(",\"events\":[");
  const bool readOk = FarmAutoEventLog::readLatest(static_cast<uint16_t>(offsetParam),
                                                   static_cast<uint16_t>(limitParam),
                                                   sendBusinessEventJsonCallback,
                                                   &state);
  Esp32BaseWeb::sendChunk("],\"readOk\":");
  Esp32BaseWeb::sendChunk(boolJson(readOk));
  Esp32BaseWeb::sendChunk(",\"returned\":");
  sendUint32(state.emitted);
  Esp32BaseWeb::sendChunk(",\"lastError\":\"");
  Esp32BaseWeb::writeJsonEscaped(FarmAutoEventLog::lastError());
  Esp32BaseWeb::sendChunk("\"}");
  endRawJson();
#endif
}

void FarmDoorApp::sendRecordsJson() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  DoorRecordQuery query;
  uint32_t limitParam = query.limit;
  if (!readUint32ParamOptional("start", query.startIndex) ||
      !readUint32ParamOptional("limit", limitParam) ||
      !readUint32ParamOptional("startUnixTime", query.startUnixTime) ||
      !readUint32ParamOptional("endUnixTime", query.endUnixTime) || limitParam == 0 ||
      limitParam > kDoorRecordPageMaxRecords) {
    sendCommandResultJson(DoorCommandResult::InvalidArgument);
    return;
  }
  query.limit = static_cast<uint8_t>(limitParam);
  char eventType[32];
  if (Esp32BaseWeb::getParam("eventType", eventType, sizeof(eventType)) && eventType[0] != '\0') {
    if (!doorRecordTypeFromName(eventType, query.type)) {
      sendCommandResultJson(DoorCommandResult::InvalidArgument);
      return;
    }
    query.typeFilterEnabled = true;
  }
  uint32_t archiveIndex = 0;
  if (!readUint32ParamOptional("archive", archiveIndex) || archiveIndex > kDoorRecordMaxArchives) {
    sendCommandResultJson(DoorCommandResult::InvalidArgument);
    return;
  }

  beginRawJson(200);
#if ESP32BASE_ENABLE_FS
  char recordPath[96];
  if (!doorRecordPathForArchive(archiveIndex, recordPath, sizeof(recordPath))) {
    sendCommandResultJson(DoorCommandResult::InvalidArgument);
    return;
  }
  DoorRecordPage page;
  const DoorRecordReadResult readResult = readDoorRecordPage(recordPath,
                                                             query,
                                                             doorRecordFileSize,
                                                             readDoorRecordBytesAt,
                                                             nullptr,
                                                             page);
  if (readResult == DoorRecordReadResult::Ok && page.totalRecords > 0) {
    Esp32BaseWeb::sendChunk("{\"source\":\"flash\",\"start\":");
    sendUint32(page.startIndex);
    Esp32BaseWeb::sendChunk(",\"archive\":");
    sendUint32(archiveIndex);
    Esp32BaseWeb::sendChunk(",\"nextIndex\":");
    sendUint32(page.nextIndex);
    Esp32BaseWeb::sendChunk(",\"limit\":");
    sendUint32(limitParam);
    Esp32BaseWeb::sendChunk(",\"count\":");
    sendUint32(page.count);
    Esp32BaseWeb::sendChunk(",\"totalRecords\":");
    sendUint32(page.totalRecords);
    Esp32BaseWeb::sendChunk(",\"recordBytes\":");
    sendUint32(kDoorRecordEncodedMaxBytes);
    Esp32BaseWeb::sendChunk(",\"records\":[");
    for (uint8_t i = 0; i < page.count; ++i) {
      if (i > 0) {
        Esp32BaseWeb::sendChunk(",");
      }
      sendRecordJson(page.records[i]);
    }
    Esp32BaseWeb::sendChunk("]}");
    endRawJson();
    return;
  }
  if (archiveIndex > 0) {
    Esp32BaseWeb::sendChunk("{\"source\":\"flash\",\"start\":0,\"archive\":");
    sendUint32(archiveIndex);
    Esp32BaseWeb::sendChunk(",\"nextIndex\":0,\"limit\":");
    sendUint32(limitParam);
    Esp32BaseWeb::sendChunk(",\"count\":0,\"totalRecords\":0,\"recordBytes\":");
    sendUint32(kDoorRecordEncodedMaxBytes);
    Esp32BaseWeb::sendChunk(",\"records\":[]}");
    endRawJson();
    return;
  }
#endif

  const DoorRecordSnapshot snapshot = g_records.snapshot();
  Esp32BaseWeb::sendChunk("{\"source\":\"ram\",\"start\":0,\"limit\":");
  sendUint32(kDoorRecentRecordCapacity);
  Esp32BaseWeb::sendChunk(",\"count\":");
  sendUint32(snapshot.count);
  Esp32BaseWeb::sendChunk(",\"totalRecords\":");
  sendUint32(snapshot.count);
  Esp32BaseWeb::sendChunk(",\"capacity\":");
  sendUint32(kDoorRecentRecordCapacity);
  Esp32BaseWeb::sendChunk(",\"records\":[");
  for (uint8_t i = 0; i < snapshot.count; ++i) {
    if (i > 0) {
      Esp32BaseWeb::sendChunk(",");
    }
    sendRecordJson(snapshot.records[i]);
  }
  Esp32BaseWeb::sendChunk("]}");
  endRawJson();
#endif
}

void FarmDoorApp::handleDoorOpen() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  const uint32_t commandId = allocateCommandId();
  DoorCommandResult result = DoorCommandResult::InvalidArgument;
  if (g_motorOutputEnabled) {
    result = g_door.requestOpen();
    if (result == DoorCommandResult::Ok) {
      result = startDoorMotorTo(g_door.snapshot().targetPulses);
    }
  }
  DoorRecord record;
  record.commandId = commandId;
  record.type = DoorRecordType::CommandRequested;
  record.result = doorRecordResultFromCommand(result);
  record.command = DoorCommand::Open;
  record.newTravelPulses = g_door.snapshot().openTargetPulses;
  recordBusinessEvent(record);
  sendCommandResultJson(result, commandId);
#endif
}

void FarmDoorApp::handleDoorClose() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  const uint32_t commandId = allocateCommandId();
  DoorCommandResult result = DoorCommandResult::InvalidArgument;
  if (g_motorOutputEnabled) {
    result = g_door.requestClose();
    if (result == DoorCommandResult::Ok) {
      result = startDoorMotorTo(g_door.snapshot().targetPulses);
    }
  }
  DoorRecord record;
  record.commandId = commandId;
  record.type = DoorRecordType::CommandRequested;
  record.result = doorRecordResultFromCommand(result);
  record.command = DoorCommand::Close;
  recordBusinessEvent(record);
  sendCommandResultJson(result, commandId);
#endif
}

void FarmDoorApp::handleDoorStop() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  const uint32_t commandId = allocateCommandId();
  const DoorSnapshot snapshot = g_door.snapshot();
  int64_t stoppedPosition = snapshot.positionPulses;
  if (g_motorOutputReady) {
    g_motor.requestStop();
    stoppedPosition = g_motor.snapshot().positionPulses;
  }
  const DoorCommandResult result = g_door.requestStop(stoppedPosition);
  DoorRecord record;
  record.commandId = commandId;
  record.type = DoorRecordType::CommandRequested;
  record.result = doorRecordResultFromCommand(result);
  record.command = DoorCommand::Stop;
  record.oldPositionPulses = snapshot.positionPulses;
  record.newPositionPulses = stoppedPosition;
  recordBusinessEvent(record);
  if (result == DoorCommandResult::Ok) {
    persistDoorRecoveryStateIfReady();
  }
  sendCommandResultJson(result, commandId);
#endif
}

